Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāvaipulya Sūtra “A Multitude of Buddhas”

source: བཅོམ་ལྡན་འདས་མཉན་དུ་ཡོད་པའི་ཛེ་ཏའི་ཚལ་སྐྱབས་མྱེད་པ་ལ་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བའི་ནང་ཕོ་བྲང་བརྩེགས་པ་རྒྱན་ཆེན་པོ་ཅན་ན། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་དང་འཇམ་དཔལ་ལ་སྩོགས་པ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་པ་དམ་པའི་ཡེ་ཤེས་དང་། བརྟན་པ་དམ་པའི་ཡེ་ཤེས་དང་། ཆགས་མྱེད་དམ་པའི་ཡེ་ཤེས་དང་། མེ་ཏོག་དམ་པའི་ཡེ་ཤེས་དང་། ཉི་མ་དམ་པའི་ཡེ་ཤེས་དང་། ཟླ་བ་དམ་པའི་ཡེ་ཤེས་དང་། དྲི་མྱེད་དམ་པའི་ཡེ་ཤེས་དང་། རྡོ་རྗེ་དམ་པའི་ཡེ་ཤེས་དང་། རྡུལ་མྱེད་དམ་པའི་ཡེ་ཤེས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་སྣང་བ་དམ་པའི་ཡེ་ཤེས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྐར་མའི་རྒྱལ་མཚན་དང་། རི་རབ་རྒྱལ་མཚན་དང་། རིན་ཆེན་རྒྱལ་མཚན་དང་། ཆགས་མྱེད་རྒྱལ་མཚན་དང་། མེ་ཏོག་རྒྱལ་མཚན་དང་། དྲི་མྱེད་རྒྱལ་མཚན་དང་། ཉི་མའི་རྒྱལ་མཚན་དང་། མཛེས་པའི་རྒྱལ་མཚན་དང་། རྡུལ་མྱེད་རྒྱལ་མཚན་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་སྣང་བའི་རྒྱལ་མཚན་དང་། བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་གཟི་བརྗིད་དང་། བློ་གྲོས་ཆེན་པོའི་གཟི་བརྗིད་དང་། ཡེ་ཤེས་རྡོ་རྗེའི་གཟི་བརྗིད་དང་། དྲི་མ་མྱེད་པའི་གཟི་བརྗིད་དང་། ཆོས་ཀྱི་ཉི་མའི་གཟི་བརྗིད་དང་། བསོད་ནམས་རི་བོའི་གཟི་བརྗིད་དང་། ཡེ་ཤེས་སྣང་བའི་གཟི་བརྗིད་དང་། ཀུན་ནས་དཔལ་གྱི་གཟི་བརྗིད་དང་། ཀུན་ནས་འོད་དཔལ་གཟི་བརྗིད་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཕྱོགས་བཅུ་སྣང་བས་རྒྱས་པར་འགེངས་པའི་གཟི་བརྗིད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སའི་སྙིང་པོ་དང་། ནམ་མཁའི་སྙིང་པོ་དང་། པདྨའི་སྙིང་པོ་དང་། རིན་པོ་ཆེའི་སྙིང་པོ་དང་། ཉི་མའི་སྙིང་པོ་དང་། ཡོན་ཏན་རྣམ་དག་སྙིང་པོ་དང་། ཆོས་རྒྱ་མཚོའི་སྙིང་པོ་དང་། རྣམ་པར་སྣང་བའི་སྙིང་པོ་དང་། གཙུག་གི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་པདྨོ་དཔལ་གྱི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བཟང་པོའི་མྱིག་དང་། རྣམ་པར་དག་པའི་མྱིག་དང་། དྲི་མ་མྱེད་པའི་མྱིག་དང་། ཆགས་པ་མྱེད་པའི་མྱིག་དང་། ཀུན་ནས་ལྟ་བའི་མྱིག་དང་། ཤིན་ཏུ་རྣམ་པར་ལྟ་བའི་མྱིག་དང་། ཨུཏྤ་ལའི་མྱིག་དང་། རྡོ་རྗེའི་མྱིག་དང་། རིན་པོ་ཆེའི་མྱིག་དང་། བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་མྱིག་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཅོད་པན་དང་། ཆོས་ཀྱི་དབྱིངས་སྣང་བའི་བློ་གྲོས་ཅོད་པན་དང་། བྱང་ཆུབ་དམ་པའི་ཅོད་པན་དང་། ཕྱོགས་རྣམ་པར་སྣང་བའི་ཅོད་པན་དང་། སངས་རྒྱས་ཐམས་ཅད་ཡང་དག་པར་འབྱུང་བའི་སྙིང་པོའི་ཅོད་པན་དང་། འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པའི་ཅོད་པན་དང་། ཀུན་ནས་རྣམ་པར་སྣང་བའི་ཅོད་པན་དང་། ཟིལ་གྱིས་ནོན་པ་མྱེད་པའི་ཅོད་པན་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སེང་གེའི་ཁྲི་འཛིན་པའི་ཅོད་པན་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའ་ཀུན་ནས་སྣང་བའི་ཅོད་པན་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཚངས་པའི་དབང་པོའི་གཙུག་ཕུད་དང་། ཀླུའི་དབང་པོའི་གཙུག་ཕུད་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྤྲུལ་པ་སྣང་བའི་གཙུག་ཕུད་དང་། བྱང་ཆུབ་དམ་པའི་གཙུག་ཕུད་དང་། སྨོན་ལམ་རྒྱ་མཚོ་ཐམས་ཅད་རབ་ཏུ་སྒྲོག་པའི་རིན་ཆེན་རྒྱལ་པོའི་གཙུག་ཕུད་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་འགྱེད་པའི་ནོར་བུ་རིན་ཆེན་འབྲུག་སྒྲའི་གཙུག་ཕུད་དང་། ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་ཐ་མྱི་དད་པར་རྣམ་པར་དམྱིགས་པའི་རིན་ཆེན་རྒྱལ་པོས་བརྒྱན་པའི་གཙུག་ཕུད་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་རྣམ་པར་འཕྲུལ་པ་སྣང་བའི་རྒྱལ་མཚན་དང་། རིན་པོ་ཆེའི་རྒྱལ་པོ་དྲ་བས་ཀུན་ནས་ཡོག་པའི་གཙུག་ཕུད་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་སྒྲོག་པའི་གཙུག་ཕུད་དང་། བྱང་ཆུབ་སེམས་དཔའ་དུས་གསུམ་གྱི་མྱིང་ཐམས་ཅད་རབ་ཏུ་སྒྲོག་པའི་གཙུག་ཕུད་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྒྱ་ཆེན་པོའི་འོད་དང་། གཟི་བརྗིད་དྲི་མ་མྱེད་པའི་འོད་དང་། རིན་པོ་ཆེའི་འོད་དང་། རྡུལ་དང་བྲལ་བའི་འོད་དང་། སྐར་མའི་འོད་དང་། ཆོས་ཀྱི་འོད་དང་ཞི་བའི་འོད་དང་། ཉི་མའི་འོད་དང་རྣམ་པར་འཕྲུལ་པའི་འོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་འོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་དཔལ་དང་། ཡེ་ཤེས་དཔལ་དང་། ཆོས་ཀྱི་དཔལ་དང་། མངོན་པར་ཤེས་པའི་དཔལ་དང་། འོད་ཀྱི་དཔལ་དང་། མེ་ཏོག་དཔལ་དང་། རིན་པོ་ཆེའི་དཔལ་དང་། བྱང་ཆུབ་ཀྱི་དཔལ་དང་། ཚངས་པའི་དཔལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ནས་སྣང་བའི་དཔལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཚངས་པའི་དབྱངས་དང་། རྒྱ་མཚོའི་དབྱངས་དངས་སྒྲའི་དབྱངས་དང་། འཇིག་རྟེན་དབང་པོའི་དབྱངས་དང་། རི་དབང་རྒྱལ་པོ་འཐབ་པའི་དབྱངས་དང་། ཆོས་ཀྱི་དབྱིངས་ཀུན་ཏུ་རྒྱས་པའི་དབྱངས་དང་། ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་རབ་ཏུ་སྒྲོག་པའི་དབྱངས་དང་། བདུད་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་རབ་ཏུ་འདུལ་བའི་དབྱངས་དང་། སྙིང་རྗེ་ཆེན་པོའི་ཚུལ་གྱི་སྤྲིན་རབ་ཏུ་སྒྲོག་པའི་དབྱངས་དང་། བྱང་ཆུབ་སེམས་དཔའ་འགྲོ་བ་ཐམས་ཅད་སྡུག་བསྔལ་རབ་ཏུ་ཞི་བར་བྱ་བའི་དབུགས་འབྱིན་པའི་དབྱངས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱིས་འཕགས་པ་དང་། ཁྱད་པར་གྱིས་འཕགས་པ་དང་། ཡེ་ཤེས་ཀྱིས་འཕགས་པ་དང་། བསོད་ནམས་རི་བོས་འཕགས་པ་དང་། ཡོན་ཏན་གྱི་ཚོགས་ཀྱིས་འཕགས་པ་དང་། གྲགས་པས་འཕགས་པ་དང་། ཀུན་ཏུ་སྣང་བས་འཕགས་པ་དང་། བྱམས་པ་ཆེན་པོས་འཕགས་པ་དང་། ཡེ་ཤེས་རྒྱ་མཚོས་འཕགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་རྒྱུད་ཀྱི་གདུང་གིས་འཕགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་འོད་ཀྱི་དཔལ་དང་། མཆོག་གི་དཔལ་དང་། ཀུན་ཏུ་འཕགས་པའི་དཔལ་དང་། རྣམ་པར་སྣང་བའི་དཔལ་དང་། ཆོས་ཀྱི་དཔལ་དང་། ཟླ་བའི་དཔལ་དང་། ནམ་མཁའི་དཔལ་དང་། རིན་པོ་ཆེའི་དཔལ་དང་། དཔལ་གྱི་དཔལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་ཀྱི་དཔལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རིའི་དབང་པོའི་རྒྱལ་པོ་དང་། ཆོས་ཀྱི་དབང་པོའི་རྒྱལ་པོ་དང་། འགྲོ་བའི་དབང་པོའི་རྒྱལ་པོ་དང་། ཚངས་པའི་དབང་པོའི་རྒྱལ་པོ་དང་། ཚོགས་ཀྱི་དབང་པོའི་རྒྱལ་པོ་དང་། ལྷའི་དབང་པོའི་རྒྱལ་པོ་དང་། ཞི་བའི་དབང་པོའི་རྒྱལ་པོ་དང་། མི་གཡོ་བའི་དབང་པོའི་རྒྱལ་པོ་དང་། ཁྱུ་མཆོག་གི་དབང་པོའི་རྒྱལ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་མཆོག་གི་དབང་པོའི་རྒྱལ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རབ་ཏུ་ཞི་བའི་སྒྲ་དང་། ཆགས་པ་མྱེད་པའི་སྒྲ་དང་། སའི་དབྱངས་ཀྱི་སྒྲ་དང་། རྒྱ་མཚོའི་འབྲུག་གི་སྒྲ་དང་། སྤྲིན་གྱི་དབྱངས་ཀྱི་སྒྲ་དང་། ཆོས་སྣང་བའི་སྒྲ་དང་། ནམ་མཁའི་དབྱངས་ཀྱི་སྒྲ་དང་། སེམས་ཅན་ཀུན་གྱི་དགེ་བའི་རྩ་བ་རབ་ཏུ་སྒྲོག་པའི་སྒྲ་དང་། སྔོན་གྱི་སྨོན་ལམ་ཡོངས་སུ་བསྐུལ་བའི་སྒྲ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བདུད་ཀྱི་དཀྱིལ་འཁོར་བཅོམ་ཞིང་མྱེད་པར་བྱེད་པའི་སྒྲ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེའི་བློ་དང་། ཡེ་ཤེས་རི་བོའི་བློ་དང་། ནམ་མཁའི་བློ་དང་། དྲི་མ་མྱེད་པའི་བློ་དང་། ཆགས་པ་མྱེད་པའི་བློ་དང་། རྣམ་པར་སངས་རྒྱས་པའི་བློ་དང་། དུས་གསུམ་སྣང་བའི་བློ་དང་། ཡངས་པའི་བློ་དང་། ཀུན་ཏུ་སྣང་བའི་བློ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དབྱིངས་སུ་སྣང་བའི་བློ་དང་།
en: The Bhagavat was in a greatly adorned kūṭāgāra in Jetavana, Anāthapiṇḍada’s park, in Śrāvastī, together with the bodhisattvas Samanta­bhadra, Mañjuśrī, and others, including the bodhisattva mahāsattvas Jñānottara­jñānin, Sattvottara­jñānin, Asaṅgottara­jñānin, Kusumottara­jñānin, Sūryottara­jñānin, Candrottara­jñānin, Vimalottara­jñānin, Vajrottara­jñānin, Virajottara­jñānin, and the bodhisattva Vairocanottara­jñānin; the bodhisattvas Jyotirdhvaja, Merudhvaja, Ratnadhvaja, Asaṅga­dhvaja, Kusumadhvaja, Vimala­dhvaja, Sūrya­dhvaja, Rucira­dhvaja, Virajadhvaja, and the bodhisattva Vairocana­dhvaja; the bodhisattvas Ratnatejas, Mahātejas, Jñāna­vajra­tejas, Vimala­tejas, Dharma­sūrya­tejas, Puṇya­parvata­tejas, Jñānāvabhāsa­tejas, Samanta­śrī­tejas, Samanta­prabha­śrī­tejas, and the bodhisattva Daśa­dikprabha­parisphuṭa; the bodhisattvas Dhāraṇīgarbha, Gagana­garbha, Padma­garbha, Ratnagarbha, Sūrya­garbha, Guṇa­viśuddhi­garbha, Dharma­samudra­garbha, Vairocana­garbha, Nābhigarbha, and the bodhisattva Padma­śrī­garbha; the bodhisattvas Sunetra, Viśuddhanetra, Vimala­netra, Asaṅga­netra, Samanta­darśana­netra, Suvilokita­netra, Avalokitanetra, Utpalanetra, Vajranetra, Ratnanetra, and the bodhisattva Gagana­netra; the bodhisattvas Deva­mukuṭa, Dharma­dhātu­pratibhāsa­maṇi­mukuṭa, Bodhi­maṇḍa­mukuṭa, Digvairocana­mukuṭa, Sarva­buddha­saṃbhūta­garbha­maṇi­mukuṭa, Sarva­loka­dhātūdgata­mukuṭa, Samanta­vairocana­mukuṭa, Anabhibhūta­mukuṭa, Sarva­tathāgata­siṃhāsana­saṃpratiṣṭhita­maṇi­mukuṭa, and the bodhisattva Samanta­dharma­dhātu­gagana­pratibhāsa­mukuṭa; the bodhisattvas Brahmendracuḍa, Nāgendracūḍa, Sarva­buddha­nirmāṇa­pratibhāsa­cūḍa, Bodhimaṇḍacūḍa, Sarva­praṇidhāna­sāgara­nirghoṣa­maṇi­rāja­cūḍa, Sarva­tathāgata­prabhā­maṇḍala­pramuñcana­maṇi­ratna­nigarjita­cūḍa, Sarvākāśa­talāsaṃbheda­vijñapti­maṇi­ratna­vibhūṣita­cūḍa, Sarva­tathāgata­vikurvita­pratibhāsa­dhvaja­maṇi­rāja­jāla­saṃchādita­cūḍa, Sarva­tathāgata­dharma­cakra­nirghoṣa­cūḍa, and the bodhisattva Sarva­tryadhva­nāma­cakra­nirghoṣa­cūḍa; the bodhisattvas Mahāprabha, Vimala­prabha, Vimala­tejaḥ­prabha, Ratnaprabha, Virajaprabha, Jyotiṣprabha, Dharmaprabha, Śānti­prabha, Sūrya­prabha, Vikurvita­prabha, and the bodhisattva Devaprabha; the bodhisattvas Puṇya­ketu, Jñānaketu, Dharmaketu, Abhijñāketu, Prabhāketu, Kusumaketu, Maṇiketu, Bodhiketu, Brahmaketu, and the bodhisattva Samantāvabhāsa­ketu; the bodhisattvas Brahmaghoṣa, Sāgara­ghoṣa, Dharaṇī­nirnāda­ghoṣa, Lokendra­ghoṣa, Śailendra­rāja­saṃghaṭṭana­ghoṣa, Sarva­dharma­dhātu­spharaṇa­ghoṣa, Sarva­dharma­dhātu­sāgara­nigarjita­ghoṣa, Sarva­māra­maṇḍala­pramardaṇa­ghoṣa, Mahā­karuṇānaya­megha­nigarjita­ghoṣa, and the bodhisattva Sarva­jagad­duḥkha­praśāntyāśvāsana­ghoṣa; the bodhisattvas Dharmodgata, Viśeṣodgata, Jñānodgata, Puṇya­sumerūdgata, Guṇa­prabhāvodgata, Yaśodgata, Samantāvabhāsodgata, Mahā­maitryudgata, Jñāna­saṃbhārodgata, and Tathāgata­kula­gotrodgata; the bodhisattvas Prabhāśrī, Pravaraśrī, Samudgataśrī, Vairocana­śrī, Dharmaśrī, Candra­śrī, Gagana­śrī, Ratnaśrī, Ketuśrī, and the bodhisattva Jñāna­śrī; the bodhisattvas Śailendra­rāja, Dharmendrarāja, Jagadindrarāja, Brahmendrarāja, Gaṇendrarāja, Devendrarāja, Śāntendrarāja, Acalendrarāja, Ṛṣabhendrarāja, and the bodhisattva Pravarendra­rāja; the bodhisattvas Praśānta­svara, Asaṅga­svara, Dharaṇī­nirghoṣa­svara, Sāgara­nigarjita­svara, Megha­nirghoṣa­svara, Dharmāvabhāsa­svara, Gagana­nirghoṣa­svara, Sarva­sattva­kuśala­mūla­nigarjita­svara, Pūrva­praṇidhāna­saṃcodana­svara, and the bodhisattva Māra­maṇḍala­nirghoṣa­svara; and the bodhisattvas Ratnabuddhi, Jñānabuddhi, Gagana­buddhi, Vimala­buddhi, Asaṅga­buddhi, Viśuddhabuddhi, Tryadhvāvabhāsa­buddhi, Viśālabuddhi, Samantāvaloka­buddhi, and the bodhisattva Dharma­dhātu­nayāvabhāsa­buddhi, and so on.

source: དེ་དག་ལ་སྩོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་སྟོང་ཙམ་སྟེ། ཀུན་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་གྱིས་བྱུང་བ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རྒྱས་པར་འགེངས་པས། ཆགས་པ་མྱེད་པའི་སྤྱོད་ཡུལ་ཅན། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དྲུང་དུ་འདོང་བས་ལུས་མཐའ་ཡས་པའི་བྱིན་གྱི་རླབས་དང་ལྡན་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་བསྟན་པ་རྣམ་པར་དམྱིགས་པར་བྱ་བ་ལ་བསྒྲིབ་པ་མྱེད་པའི་མྱིག་གི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མངོན་པར་འཚང་རྒྱ་བའི་ཚེ། ཉེ་བར་འདོང་བ་རྒྱུན་མྱི་གཅོད་པས། ཚད་མྱེད་པར་ཕྱིན་པ། ཆོས་རྒྱ་མཚོའི་ཚུལ་ཐམས་ཅད་ལ་ཡེ་ཤེས་སྣང་བ། རབ་ཏུ་ཐོབ་པས་སྣང་བ་མཐའ་ཡས་པ་དང་ལྡན་པ། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམ་པར་དག་པས་བསྐལ་པ་མཐའ་ཡས་པར་ཤིན་ཏུ་སྟོན་པ་མྱི་ཟད་པ་འགྲོ་བའི་བསམ་པ་ཅི་ལྟ་བ་བཞིན་དུ་གཟུགས་ཀྱི་ལུས་ཡོངས་སུ་སྟོན་པས་ནམ་མཁའི་དབྱིངས་ཀྱིས་ཀླས་པའི་ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་རྣམ་པར་དག་ཅིང་མྱི་གནས་པ། སེམས་ཅན་གྱི་ཁམས་སེམས་ཅན་མྱེད་པ་དང་། སྲོག་མྱེད་པ་ཡོངས་སུ་ཤེས་པས་རབ་རིབ་མྱེད་པ། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་འོད་ཟེར་གྱི་དྲ་བས་རྒྱས་པར་འགེངས་པས་ནམ་མཁའ་དང་མཉམ་པ་ཤ་སྟག་དང་ཐབས་གཅིག་ཏུ་བཞུགས་སོ། །
en: There were five thousand bodhisattvas in all who had all arisen from completely good bodhisattva conduct and prayers, who had unimpeded fields of activity because they pervaded all buddha realms, who had the blessing of infinite bodies because they came into the presence of all tathāgatas, who had the pure orbs of unobscured eyes because they saw the manifestations of all the buddhas, who had gone to receive measureless proclamations because they unceasingly came into the presence of all tathāgatas when they attained buddhahood, who possessed infinite radiance through having attained the radiance of wisdom in all the ways of the ocean of the Dharma of the buddhas, who taught good qualities unceasingly throughout infinite kalpas because of their pure analytic knowledge, who had unrestricted conduct of wisdom as far as the ends of space because they manifested physical bodies in accordance with the aspirations of beings, whose sight was free from defect because they knew that the realm of beings has no souls and no beings, and who had wisdom as vast as space because they pervaded the realm of phenomena with a network of light rays.

source: ཉན་ཐོས་རྫུ་འཕྲུལ་ཆེན་པོ་དང་ལྡན་པ་ལྔ་བརྒྱ་སྟེ། ཐམས་ཅད་ཀྱང་བདེན་པའི་ཚུལ་གྱི་རང་བཞིན་མངོན་པར་ཁོང་དུ་ཆུད་པ། ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་གྱུར་པ། ཆོས་ཀྱི་རང་བཞིན་ལ་ཞུགས་པ། སྲིད་པའི་རྒྱ་མཚོ་ལས་གྱེན་དུ་འཕགས་པ། དེ་བཞིན་གཤེགས་པའི་ཚོགས་སུ་འགྱུར་བའི་སྤྱོད་ཡུལ་ཅན་ཀུན་ནས་སྦྱོར་བ་དང་། བག་ལ་ཉལ་བ་དང་བཅིངས་པ་རྣམ་པར་བཟློག་པ། ཆགས་པ་མྱེད་པའི་གནས་ལ་བརྟེན་པ། ནམ་མཁའ་ལྟར་ཞི་བ་ལ་རྣམ་པར་སྤྱོད་པ། སངས་རྒྱས་ལ་ཐེ་ཙོམ་དང་ནེམ་ནུར་དང་། ཡིད་གཉིས་ཡོངས་སུ་ཆད་པ། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་རྒྱ་མཚོ་ལ་མོས་པའི་ལམ་དུ་ཞུགས་པ་ཤ་སྟག་དང་། འཇིག་རྟེན་གྱི་དབང་པོ་སྔོན་གྱི་རྒྱལ་བ་ལ་བྱ་བ་བྱས་པ།
en: There were five hundred śrāvakas endowed with miraculous powers, all of whom had realized the nature of the way of the truths; directly perceived the true finality; comprehended the nature of phenomena; transcended the ocean of existence; had the range of activity of the tathāgatas that is as extensive as space; had ended fetters, predispositions, and bondage; remained in an unobstructed state; dwelled in a peace that was like space; had eliminated doubts, uncertainty, and equivocation concerning the buddhas; and followed the path of aspiration for the ocean of the wisdom of the buddhas.

source: འགྲོ་བ་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བའི་དོན་དུ་ཞུགས་པ། གསོལ་བ་མ་བཏབ་པར་དགེ་བའི་བཤེས་གཉེན་དུ་གྱུར་པ། སེམས་ཅན་གཞན་བསྲུང་བ་ལ་ཞུགས་པ། འཇིག་རྟེན་ཐམས་ཅད་ལས་འཕགས་པའི་ཁྱད་པར་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱི་སྒོ་ལ་ཞུགས་པ། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མྱི་གཏོང་པའི་སེམས་དང་ལྡན་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བསྟན་པའི་སྤྱོད་ཡུལ་ལ་བྱུང་བ་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ཡོངས་སུ་བསྲུང་བ་ལ་ཞུགས་པ། སངས་རྒྱས་ཀྱི་རིགས་ཡང་དག་པར་གཟུང་བའི་སྨོན་ལམ་གྱིས་ཡང་དག་པར་སྐྱེས་པ། དེ་བཞིན་གཤེགས་པའི་གདུང་གི་རྒྱུད་དུ་འབྱུང་བ་མངོན་དུ་གྱུར་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་མངོན་པར་མོས་པ་ཤ་སྟག་དང་ཡང་ཐབས་གཅིག་གོ །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་དང་བཅས་པ་དེ་དག་དང་། ཉན་ཐོས་རྫུ་འཕྲུལ་ཆེན་པོ་དང་ལྡན་པ། དེ་དག་དང་འཇིག་རྟེན་གྱི་དབང་པོ་འཁོར་དང་བཅས་པ་དེ་དག་འདི་སྙམ་དུ་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པའི་ཡུལ་དང་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་དང་། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། དེ་བཞིན་གཤེགས་པའི་མྱི་བསྙེངས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་དང་། དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་སྤྱོད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་མངའ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་དང་། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་དང་། དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་དང་། དེ་བཞིན་གཤེགས་པའི་མཐུ་དང་། དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་སྨོན་ལམ་དང་། སྔོན་ལེགས་པར་སྤྱད་པའི་དགེ་བའི་རྩ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་སྐྱབས་དང་། དད་པའི་མྱིག་ཡོངས་སུ་དག་པ་དང་། རྒྱ་ཆེན་པོ་ལ་མོས་པའི་སྣང་བ་རབ་ཏུ་ཐོབ་པ་དང་།
en: There were lords of the world who had served previous jinas, who were dedicated to bringing benefit and happiness to all beings, who became good guides without being asked, who were dedicated to protecting other beings, who had attained the gateway to wisdom that transcends the world, who had the motivation of never abandoning all beings, who had originated from the field of activity of the teaching of all buddhas, who were dedicated to protecting the teachings of the tathāgatas, who were born through prayers to be within the family of the buddhas, who had attained being within the family lineage of the tathāgatas, and who aspired to omniscience.

source: བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་བསམ་པ་རྣམ་པར་དག་པ་དང་། བསམ་པ་ཐག་པའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སྨོན་ཅིང་ཡང་དག་པར་ཞུགས་པ་མ་གཏོགས་པར་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་འཇུག་པའམ། ཁོང་དུ་ཆུད་པའམ་ཡིད་ཆེས་པའམ། ཡོངས་སུ་ཤེས་པའམ། རྣམ་པར་རྟོག་པའམ། གཟུང་བའམ་རྣམ་པར་དཔྱད་པའམ། རྣམ་པར་བསྒོམ་པའམ། རྣམ་པར་དབྱེ་བའམ། རྣམ་པར་དགྲོལ་བའམ། རབ་ཏུ་བརྗོད་པའམ། སེམས་ཅན་ཕ་རོལ་གྱི་རྒྱུད་དུ་ཕྱིན་པར་བྱ་བར་ནི་མྱི་ནུས་ན།
en: Then those bodhisattvas and their followers, and the śrāvakas who had miraculous powers and the lords of the world and their followers thought, “Without the Tathāgata’s blessing, without the Tathāgata’s manifestations, without the Tathāgata’s power, without the Tathāgata’s past prayers, without a past excellent practice of the roots of merit, without the guidance of a kalyāṇamitra, without the pure eyes of faith, without the attainment of the radiance of a vast aspiration, without the pure superior motivation of a bodhisattva, and without the determined aspiration for omniscience, it is not possible for worldly beings and devas to comprehend, or understand, or believe in, or know, or conceive of, or grasp, or analyze, or meditate on, or classify, or reveal, or describe, or establish within other beings the Tathāgata’s domain, the scope of the Tathāgata’s wisdom, the Tathāgata’s blessing, the Tathāgata’s strengths, the Tathāgata’s fearlessness, the Tathāgata’s samādhi, the Tathāgata’s conduct, the Tathāgata’s state, the Tathāgata’s supremacy, the Tathāgata’s body, or the Tathāgata’s wisdom.

source: བཅོམ་ལྡན་འདས་ཉིད་ཀྱིས་བདག་ཅག་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་པའི་ཚུལ་ཇི་ལྟ་བ་དང་། སེམས་ཅན་བསམ་པ་རྣམ་པ་ཐ་དད་པ་དང་། མོས་པ་སྣ་ཚོགས་དང་། ཤེས་པ་སྣ་ཚོགས་ཀྱི་ཚིགས་དང་། བརྡ་སྣ་ཚོགས་སུ་གྱུར་པ། དབང་བསྒྱུར་བའི་ས་གཞན་དང་། གཞན་ལ་གནས་པ་དབང་པོ་སྣ་ཚོགས་སུ་རྣམ་པར་དག་པ། བསམ་པ་དང་སྦྱོར་བ་རྣམ་པ་གཞན་དང་གཞན་ཅན། སེམས་དང་བསམ་པའི་ཡུལ་གཞན་དང་གཞན་ཅན།
en: “May the Bhagavat teach us—we who have the aspirations of bodhisattvas—as well as all beings, who—because of their various aspirations, different kinds of motivations, and different kinds of knowledge—use different kinds of words and terms, are on different levels of power, and have different purity of faculties, different kinds of motivation and conduct, different ranges of thought, different kinds of reliance on the qualities of the tathāgatas, and different kinds of interest in the teaching of the Dharma.

source: དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གཞན་དང་གཞན་ལ་གནས་པ། ཆོས་བསྟན་པ་གཞན་དང་གཞན་ལ་མོས་པ་དག་ལ་སྔོན་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཞུགས་པ་ལྟ་འང་ཡང་དག་པར་བསྟན་གྲང་།
en: “May he teach us how in the past he set out to attain omniscience.

source: སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་ལྟ་འང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he teach us how in the past he accomplished the aspiration of a bodhisattva.

source: སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པ་ལྟའང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he teach us how in the past he had a pure field of the perfections of a bodhisattva.

source: སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་མནན་པའི་རྣམ་པར་འཕྲུལ་པ་ལྟའང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he teach us how in the past he had the miraculous manifestations of having reached the level of a bodhisattva.

source: སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་མངོན་པར་བསྒྲུབ་པ་ཡོངས་སུ་རྫོགས་པར་མཛད་པ་ལྟའང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he teach us how in the past he had completely accomplished the field of conduct of a bodhisattva.

source: སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་མངོན་པར་བསྒྲུབ་པ་རྣམ་པར་ཕྱེ་བའི་སྣང་བ་ལྟའང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he teach us how in the past he had displayed accomplishing the way of a bodhisattva.

source: སྔོན་བྱང་ཆུབ་སེམས་དཔའི་ལམ་གྱི་རྒྱན་ཡོངས་སུ་དག་པར་མཛད་པ་ལྟའང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he teach us how in the past he had a pure display of the bodhisattva’s path.

source: སྔོན་བྱང་ཆུབ་སེམས་དཔའི་འབྱུང་བའི་ཚུལ་རྒྱ་མཚོ་མངོན་པར་བསྒྲུབ་པ་ལྟའང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he teach us how in the past he displayed the accomplishment of an ocean of a bodhisattva’s ways of going forth.

source: སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་ཡང་དག་པར་བསྒྲུབ་པ་དང་། རྣམ་པར་འཕྲུལ་པའི་རྒྱན་ཕུན་སུམ་ཚོགས་པ་ལྟའང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he teach us how in the past he perfectly displayed an ocean of the miraculous manifestations that are a bodhisattva’s attainments.

source: བྱང་ཆུབ་སེམས་དཔའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་ལྟའང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he teach us how in the past he had an ocean of a bodhisattva’s practices.

source: མངོན་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སྒོས་རྣམ་པར་འཕྲུལ་པ་ལྟའང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he teach us how he has an ocean of miraculous manifestations through attaining enlightenment.

source: དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར། བའི་རྣམ་པར་འཕྲུལ་པ་དང་། ཁྱུ་མཆོག་གི་མཐུ་ལྟའང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he also teach us how he has manifested the most powerful miraculous manifestation of turning a tathāgata’s wheel of the Dharma.

source: དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་རྣམ་པར་འཕྲུལ་པ་ལྟའང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he also teach us how he has an ocean of the miraculous manifestations of purifying a tathāgata’s buddha realm.

source: དེ་བཞིན་གཤེགས་པའི་སེམས་ཅན་གྱི་ཁམས་འདུལ་བའི་ཐབས་ཀྱི་སྒོ་ལྟའང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he also teach us how he has the gateway of methods for guiding the realm of beings.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་ཀྱི་གྲོང་ཁྱེར་ལ་མངའ་མཛད་པ་ལྟ་འང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he also teach us how he has sovereignty over the city of the Dharma of an omniscient tathāgata.

source: དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལམ་སྣང་བར་མཛད་པ་ལྟའང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he also teach us how he has a tathāgata’s illumination of the path for all beings.

source: དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནས་སུ་གཤེགས་ཤིང་རྣམ་པར་འཕྲུལ་པ་མཛད་པ་ལྟའང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he also teach us how he has a tathāgata’s miraculous manifestation of entering into the existences of beings.

source: དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡོན་པ་ཞེས་པ་མཛད་པ་ལྟའང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he also teach us how he receives the offerings of beings for a tathāgata.

source: དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསོད་ནམས་དང་ཡོན་ཏན་སྟོན་པའི་ཆོ་འཕྲུལ་མཛད་པ་ལྟའང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he also teach us how he has a tathāgata’s miracle of teaching merit and offerings to all beings.

source: དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་ཚུལ་ལ་སངས་རྒྱས་ཀྱི་གཟུགས་བརྙན་དམྱིགས་པ་མཛད་པ་ལྟའང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he also teach us how the Tathāgata has created the perceived image of a buddha within the mental processes of all beings.

source: དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ཐམས་ཅད་ལ། རྣམ་པར་འཕྲུལ་པའི་ཆོ་འཕྲུལ་མཛད་པ་ལྟའང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he also teach us how the Tathāgata has created magical manifestations for all beings.

source: དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ཐམས་ཅད་ལ་ཡོངས་སུ་བསྟན་པ་དང་། རྗེས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་མཛད་པ་ལྟའང་ཡང་དག་པར་བསྟན་གྲང་།
en: May he also teach us how the Tathāgata has created the magical appearances of teachings and instructions for all beings.

source: དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ཐམས་ཅད་ལ་སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་སྤྱོད་ཡུལ་བསམ་གྱིས་མྱི་ཁྱབ་པས་རྣམ་པར་འཕྲུལ་པ་མཛད་པ་ལྟ་འང་ཡང་དག་པར་བསྟན་གྲང་སྙམ་པ་དང་།
en: May he also teach us the Tathāgata’s manifestations of the inconceivable range of the samādhis of buddhahood for all beings.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་ཐུགས་ཀྱིས་མཁྱེན་ནས། སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ནམ་མཁའ་དང་མཉམ་པས་དཔེ་མྱེད་པ་འགྲོ་བ་ཐམས་ཅད་དུ་རྣམ་པར་སྣང་བའི་རྒྱན་དང་ལྡན་པ། ཐུགས་རྗེ་ཆེན་པོའི་སྒོའི་རང་བཞིན་ཅན། ཐུགས་རྗེ་ཆེན་པོའི་སྒོ་དང་ལྡན་པ། ཐུགས་རྗེ་ཆེན་པོ་སྔོན་དུ་འགྲོ་བ། ཐུགས་རྗེ་ཆེན་པོའི་ཆོས་ཅན་ལ་མཉམ་པར་གཞག་གོ །བཅོམ་ལྡན་འདས་ཀྱི་དེ་ལྟར་མཉམ་པར་བཞག་མ་ཐག་ཏུ་ཕོ་བྲང་བརྩེགས་པ་རྒྱན་ཆེན་པོ་ཅན་ཡང་མཐའ་དང་དབུས་མྱེད་པར་ཡངས་ཤིང་རྡོ་རྗེ་ཐུབ་པ་མྱེད་པའི་རྒྱལ་མཚན་གྱིས་སའི་གཞི་རབ་ཏུ་བཀོད་པ་དང་། ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་དྲ་བ་ཀུན་ཏུ་བཀྲམ་པ། རིན་པོ་ཆེ་དུ་མའི་མེ་ཏོག་སིལ་མས་ཆལ་བར་གང་བ། ནོར་བུ་རིན་པོ་ཆེ་དམ་པ་མཛེས་པར་བཀྲམ་པ་དང་། བཻ་ཌཱུརྱའི་ཀ་བས་མཛེས་པར་བྱས་པ། རིན་པོ་ཆེའི་རྒྱལ་པོ་འགྲོ་བ་རྣམ་པར་སྣང་བས་རྒྱན་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ། རིན་པོ་ཆེ་བཟང་པོ་མང་པོ་དང་ལྡན་པའི་ནོར་བུ་རིན་པོ་ཆེ་འཛམ་བུའི་ཆུ་ཀླུང་གི་ཕུང་པོས་ཤིན་ཏུ་བརྒྱན་པ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ལས་སྒོ་གང་དང་། རྟ་བབས་དང་། པུ་ཤུ་དང་། སྐར་ཁུང་བྱས་ཤིང་ཁྲི་འཕང་གྲངས་མྱེད་པ་རྣམ་པར་དག་པས་བརྒྱན་པ་དང་།
en: Then the Bhagavat, knowing the thoughts in the minds of those bodhisattvas, rested in the samādhi called the gaping lion, which is as extensive as space and therefore is beyond example and has adornments that appear to all beings, has the nature of being the gateway to great compassion, possesses the gateway to great compassion, precedes great compassion, and has the quality of great compassion.
